In [1]:
#importing 
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

We use pandas pd.read_csv() function to read csv file in python and pandas dataframe method to convert file into dataframe.

In [2]:
titanic = pd.read_csv("D:\\pythonProject\\train.csv")

In [3]:
titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [4]:
titanic.shape

(891, 12)

# handaling null values

the dataset may contains many rows and columns for wich some vaules are missing , we cant leaves those values as it is.    
in such case we hav two option=                                                                                   
1) either drop entire row or column                                                                                        
2) fill missing values with some apropriate values let's mean of all values for that column may do the job

In [5]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

# seperating out the columns which have more than 35% of the missing values in the dataset

In [6]:
#df.insull().sum() returns the pandas series with column name as the label index
#and total colums of null values in the columns as it's value
#and we have storing only those columns witch have more than 35% of the data missing



drop_col = titanic.isnull().sum()[titanic.isnull().sum()>(35/100*titanic.shape[0])]
drop_col

Cabin    687
dtype: int64

NOTE = There is no specific number after which you should drop the columns. it's just that on our own acording to that we want .

In [7]:
drop_col.index

Index(['Cabin'], dtype='object')

In [8]:
titanic.drop(drop_col.index, axis =1 , inplace = True)
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [9]:
titanic.fillna(titanic.mean(),inplace= True)
titanic.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

Embarked have contains string values , we see the details of that collumns in separately from other as string does not have mean values and all

In [10]:
titanic["Embarked"].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

from Embarked atrribute, we fill null values with the most frequent value in collumns

In [11]:
titanic["Embarked"].fillna("S", inplace=True)

In [12]:
titanic.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [13]:
titanic.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.033207,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.069809,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.331339,0.083081,0.018443,-0.549500
Age,0.033207,-0.069809,-0.331339,1.000000,-0.232625,-0.179191,0.091566
SibSp,-0.057527,-0.035322,0.083081,-0.232625,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.179191,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.091566,0.159651,0.216225,1.000000

In [14]:
titanic["family_size"]= titanic["SibSp"]+titanic["Parch"]
titanic.drop(['SibSp', 'Parch'],axis=1, inplace= True)
titanic.corr()

             PassengerId  Survived    Pclass       Age      Fare  family_size
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658    -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307     0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500     0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566    -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000     0.217138
family_size    -0.040143  0.016639  0.065997 -0.248512  0.217138     1.000000

family_size in the ship does not have much correlance with survivle rate                                         
      let's check with we weather the person was alone or not can affect the survivle rate

In [15]:
titanic['Alone']=[0 if titanic['family_size'][i]>0 else 1 for i in titanic.index]
titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Embarked,family_size,Alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,A/5 21171,7.2500,S,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,PC 17599,71.2833,C,1,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,STON/O2. 3101282,7.9250,S,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,113803,53.1000,S,1,0
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,373450,8.0500,S,0,1
5,6,0,3,"Moran, Mr. James",male,29.699118,330877,8.4583,Q,0,1
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,17463,51.8625,S,0,1
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,349909,21.0750,S,4,0
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,347742,11.1333,S,2,0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,237736,30.0708,C,1,0

In [16]:
titanic.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

if the person is alone he/she are less chance to survived.                                                             
   the reason might be the person who is traveling with his family might be belonging to rich class and might be prioritized over other.

In [17]:
titanic[['Alone', 'Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

So we can see if person was not alone , the chance the ticket price is higher is high

In [18]:
titanic['Sex']=[0 if titanic['Sex'][i]=='male' else 1 for i in titanic.index]
titanic.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

it shows female passengers are survived more than male passenger

In [19]:
titanic.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

# Conclusion

1) female passengers prioritized over men.

2) the people with high class or rich people have high sirvivle rate than over. the hierarichymight have been followed while saving the passangers.

3) passenger traviling with there family have higher sirvivle rate .

4) passenger who boarded the slip at cherbourg, sirvivle more in propotion then the other.